Software Engineering CS169/Tarjimly/app/controllers/claims_controller.rb

  def requests
    if params.has_key?(:from_language)
      @requests = Request.where(:from_language => params[:from_language].capitalize, :to_language => params[:to_language].capitalize)
    else
      @requests = Request.all
---
SELECT "requests".* FROM "requests" WHERE "requests"."from_language" = $1 AND "requests"."to_language" = $2 AND "requests"."id" != $3  [["from_language", "Arabic"], ["to_language", "Farsi"], ["id", 19]]

  def show
    cid = params[:claim_id]
    @claim = Request.find(cid)
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" != $1  [["id", 19]]

  def delete
    @claim = Claim.find(params[:claim_id])
    @claim.destroy
---
SELECT "claims".* FROM "claims" WHERE "claims"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "claims" WHERE "claims"."id" = ?  [["id", 1]]