Software Engineering CS169/Tarjimly/app/controllers/requests_controller.rb

    def index
        @user = 1
        status = params[:status] || 1
        @requests = Request.where(user_tarjimly_id: @user, _status: status)
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_tarjimly_id" = $1 AND "requests"."_status" IN ($2, $3)  [["user_tarjimly_id", 1], ["_status", 0], ["_status", 1]]

    def create
        #Obtain request object from params
        @request = Request.new(request_params)

        if @request.nil? || @request.from_language.nil? || @request.to_language.nil? || @request.description.nil? || @request.title.nil? || @request.document.nil? || @request.deadline.nil?
          redirect_to new_request_url
          return
        end

        #Add in private fields
        @request.document_format = "text" #TODO: Should be conditional based on upload
        @request.user_tarjimly_id = 1 #TODO: Should be based on auth
        @request.num_claims = 0 #TODO: Should be daault in db
        @request._status = 0  #TODO: Should be daault in db

        if @request.save
---
INSERT INTO "requests" ("user_tarjimly_id", "from_language", "to_language", "document_format", "deadline", "title", "description", "categories", "num_claims", "_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"